[
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 488,
        "title": "Javascript",
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Javascript_Logo.png",
        "details": "JavaScript is a text-based programming language used both on the client-side and server-side that allows you to make web pages interactive. Where HTML and CSS are languages that give structure and style to web pages, JavaScript gives web pages interactive elements that engage a user. JavaScript simply adds dynamic content to websites to make them look good. HTML work on the look of the website without the interactive effects and all. HTML pages are static which means the content cannot be changed. It adds interactivity to web pages to make them look good."
    },
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab7b",
        "category_id": "02",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 488,
        "title": "Python",
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Python.svg/1200px-Python.svg.png",
        "details": "Python is a high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation. Python is dynamically-typed and garbage-collected. It supports multiple programming paradigms, including structured, object-oriented and functional programming. Besides web and software development, Python is used for data analytics, machine learning, and even design. We take a closer look at some of the uses of Python, as well as why it's such a popular and versatile programming language."
    },
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab8c",
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 488,
        "title": "Kotlin",
        "image_url": "https://i.pinimg.com/originals/ac/0b/71/ac0b718d995deda3e1e4ee893501324d.png",
        "details": "Kotlin is a cross-platform, statically typed, general-purpose programming language with type inference. Kotlin is designed to interoperate fully with Java, and the JVM version of Kotlin's standard library depends on the Java Class Library, but type inference allows its syntax to be more concise. Kotlin can be used for any kind of development, be it server-side, client-side web and Android. With Kotlin/Native currently in the works, support for other platforms such as embedded systems, macOS and iOS is coming"
    },
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab9d",
        "category_id": "04",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 488,
        "title": "PHP",
        "image_url": "https://www.kindpng.com/picc/m/11-118738_php-logo-png-circle-transparent-png.png",
        "details": "PHP is a general-purpose scripting language geared toward web development. It was originally created by Danish-Canadian programmer Rasmus Lerdorf in 1993. The PHP reference implementation is now produced by The PHP Group. PHP is an open-source, interpreted, and object-oriented scripting language that can be executed at the server-side. PHP is well suited for web development."
    },
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab10e",
        "category_id": "05",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 488,
        "title": "Ruby",
        "image_url": "https://www.thoughtco.com/thmb/3vvjt7qSjEW7Sif9D537m5izYqQ=/1280x1280/filters:fill(auto,1)/2000px-Ruby-logo-R.svg-56a811b75f9b58b7d0f05e83.jpg",
        "details": "Ruby is an interpreted, high-level, general-purpose programming language which supports multiple programming paradigms. It was designed with an emphasis on programming productivity and simplicity. In Ruby, everything is an object, including primitive data types. A dynamic, open source programming language with a focus on simplicity and productivity. It has an elegant syntax that is natural to read and easy to write."
    },
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab11f",
        "category_id": "06",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 488,
        "title": "C and C++",
        "image_url": "https://e7.pngegg.com/pngimages/46/626/png-clipart-c-logo-the-c-programming-language-computer-icons-computer-programming-source-code-programming-miscellaneous-template.png",
        "details": "C++ is a high-level general-purpose programming language created by Danish computer scientist Bjarne Stroustrup as an extension of the C programming language, or C with Classes. C is used in the areas where low-level programming languages are required. C programming is used in operating systems, embedded devices, OS kernels, drivers, IoT applications, and more. C++ is widely used for creating graphics-heavy software, game engines, VR applications, and web browsers."
    }
]